modules/neo-emacs/find/readme.org
#+title: readme
#+subtitle: this is subtitle
#+author: vanniuner
#+SETUPFILE: ~/.doom.d/org-head.setup

* conflict with toggle-input-method
In the mini search buffer ~C-;~  is binding to `embark-act`. It's conflict with [[~/.doom.d/modules/neo-emacs/rime/config.el][toggle-input-method]].
- There have two solution:
  - Disable short cut ~C-;~ ,we need chage file here in [[~/.emacs.d/modules/completion/vertico/config.el][vertico/config.el]].
    #+begin_src elisp -n
   (map! [remap describe-bindings] #'embark-bindings
        ;; "C-;"               #'embark-act  ; to be moved to :config default if accepted
        (:map minibuffer-local-map
         ;; "C-;"               #'embark-act
    #+end_src
  - The short cut ~C-SPC~ seems more popular for `toogle-input-method`, cause windows have a default setting for ~C-SPC~.So a better way is binding ~C-SPC~ to `toogle-input-method`
  - a new method to unbind c-; to embark-act
    #+begin_src elisp
    (map! :map (minibuffer-local-map)
        "C-;" 'toggle-input-method)
    #+end_src
* DONE most wanted
** code advice
Automatically to evil normal mode when `J` `K` be clicked.
It's actually a advice regard to `+workspace/switch-right` and `+workspace/switch-right`.
#+begin_src lisp
(map! :n "K"                  '+workspace/switch-right               )
(map! :n "J"                  '+workspace/switch-left                )
#+end_src
